Model: "functional_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_8 (InputLayer)         [(None, 150, 150, 3)]     0
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 148, 148, 16)      448
_________________________________________________________________
max_pooling2d_21 (MaxPooling (None, 74, 74, 16)        0
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 72, 72, 32)        4640
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 36, 36, 32)        0
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 34, 34, 64)        18496
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 17, 17, 64)        0
_________________________________________________________________
flatten_7 (Flatten)          (None, 18496)             0
_________________________________________________________________
dense_14 (Dense)             (None, 256)               4735232
_________________________________________________________________
dense_15 (Dense)             (None, 1)                 257
=================================================================
Total params: 4,759,073
Trainable params: 4,759,073
Non-trainable params: 0
_________________________________________________________________
