Model: "functional_123"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_62 (InputLayer)        [(None, 150, 150, 3)]     0
_________________________________________________________________
conv2d_183 (Conv2D)          (None, 148, 148, 16)      448
_________________________________________________________________
max_pooling2d_183 (MaxPoolin (None, 74, 74, 16)        0
_________________________________________________________________
conv2d_184 (Conv2D)          (None, 72, 72, 32)        4640
_________________________________________________________________
max_pooling2d_184 (MaxPoolin (None, 36, 36, 32)        0
_________________________________________________________________
conv2d_185 (Conv2D)          (None, 34, 34, 64)        18496
_________________________________________________________________
max_pooling2d_185 (MaxPoolin (None, 17, 17, 64)        0
_________________________________________________________________
flatten_61 (Flatten)         (None, 18496)             0
_________________________________________________________________
dense_122 (Dense)            (None, 256)               4735232
_________________________________________________________________
dense_123 (Dense)            (None, 1)                 257
=================================================================
Total params: 4,759,073
Trainable params: 4,759,073
Non-trainable params: 0
_________________________________________________________________
